test_results/ab_c100_n10000_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      100
Time taken for tests:   123.452 seconds
Complete requests:      10000
Failed requests:        3184
   (Connect: 0, Receive: 0, Length: 3184, Exceptions: 0)
Total transferred:      3615915 bytes
HTML transferred:       2155915 bytes
Requests per second:    81.00 [#/sec] (mean)
Time per request:       1234.517 [ms] (mean)
Time per request:       12.345 [ms] (mean, across all concurrent requests)
Transfer rate:          28.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.4      0      50
Processing:    35 1227  77.5   1231    1384
Waiting:       11 1216  77.2   1220    1375
Total:         63 1228  74.6   1231    1384

Percentage of the requests served within a certain time (ms)
  50%   1231
  66%   1246
  75%   1255
  80%   1262
  90%   1280
  95%   1294
  98%   1310
  99%   1322
 100%   1384 (longest request)