test_results/ab_c100_n10000_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        214 bytes

Concurrency Level:      100
Time taken for tests:   123.415 seconds
Complete requests:      10000
Failed requests:        8302
   (Connect: 0, Receive: 0, Length: 8302, Exceptions: 0)
Total transferred:      3613025 bytes
HTML transferred:       2153025 bytes
Requests per second:    81.03 [#/sec] (mean)
Time per request:       1234.154 [ms] (mean)
Time per request:       12.342 [ms] (mean, across all concurrent requests)
Transfer rate:          28.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.2      0      47
Processing:    70 1227  76.1   1232    1391
Waiting:        9 1216  75.8   1220    1368
Total:         70 1228  73.3   1232    1392

Percentage of the requests served within a certain time (ms)
  50%   1232
  66%   1245
  75%   1253
  80%   1259
  90%   1274
  95%   1288
  98%   1302
  99%   1314
 100%   1392 (longest request)