test_results/ab_c100_n10000_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      100
Time taken for tests:   123.675 seconds
Complete requests:      10000
Failed requests:        3388
   (Connect: 0, Receive: 0, Length: 3388, Exceptions: 0)
Total transferred:      3615712 bytes
HTML transferred:       2155712 bytes
Requests per second:    80.86 [#/sec] (mean)
Time per request:       1236.751 [ms] (mean)
Time per request:       12.368 [ms] (mean, across all concurrent requests)
Transfer rate:          28.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.3      0      53
Processing:    64 1230  79.4   1235    1431
Waiting:        9 1218  79.1   1224    1420
Total:         66 1230  76.5   1235    1431

Percentage of the requests served within a certain time (ms)
  50%   1235
  66%   1249
  75%   1258
  80%   1263
  90%   1278
  95%   1292
  98%   1309
  99%   1334
 100%   1431 (longest request)