test_results/ab_c100_n10000_run4.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      100
Time taken for tests:   123.389 seconds
Complete requests:      10000
Failed requests:        6961
   (Connect: 0, Receive: 0, Length: 6961, Exceptions: 0)
Total transferred:      3616961 bytes
HTML transferred:       2156961 bytes
Requests per second:    81.04 [#/sec] (mean)
Time per request:       1233.889 [ms] (mean)
Time per request:       12.339 [ms] (mean, across all concurrent requests)
Transfer rate:          28.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.4      0      52
Processing:    77 1227  77.3   1231    1369
Waiting:        8 1215  77.0   1220    1350
Total:         79 1228  74.3   1232    1369

Percentage of the requests served within a certain time (ms)
  50%   1232
  66%   1244
  75%   1253
  80%   1259
  90%   1276
  95%   1289
  98%   1305
  99%   1315
 100%   1369 (longest request)