test_results/ab_c100_n1000_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      100
Time taken for tests:   12.490 seconds
Complete requests:      1000
Failed requests:        774
   (Connect: 0, Receive: 0, Length: 774, Exceptions: 0)
Total transferred:      361774 bytes
HTML transferred:       215774 bytes
Requests per second:    80.06 [#/sec] (mean)
Time per request:       1248.995 [ms] (mean)
Time per request:       12.490 [ms] (mean, across all concurrent requests)
Transfer rate:          28.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  10.5      0      53
Processing:    76 1178 217.0   1234    1336
Waiting:       10 1167 216.8   1222    1325
Total:         77 1182 206.9   1234    1336

Percentage of the requests served within a certain time (ms)
  50%   1234
  66%   1250
  75%   1265
  80%   1274
  90%   1293
  95%   1308
  98%   1321
  99%   1327
 100%   1336 (longest request)