test_results/ab_c100_n1000_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      100
Time taken for tests:   12.418 seconds
Complete requests:      1000
Failed requests:        459
   (Connect: 0, Receive: 0, Length: 459, Exceptions: 0)
Total transferred:      361459 bytes
HTML transferred:       215459 bytes
Requests per second:    80.53 [#/sec] (mean)
Time per request:       1241.846 [ms] (mean)
Time per request:       12.418 [ms] (mean, across all concurrent requests)
Transfer rate:          28.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  14.6      0      65
Processing:    94 1173 203.7   1233    1305
Waiting:       10 1162 206.4   1222    1294
Total:         94 1178 190.0   1233    1306

Percentage of the requests served within a certain time (ms)
  50%   1233
  66%   1249
  75%   1256
  80%   1260
  90%   1269
  95%   1279
  98%   1288
  99%   1293
 100%   1306 (longest request)