test_results/ab_c100_n1000_run4.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      100
Time taken for tests:   12.406 seconds
Complete requests:      1000
Failed requests:        209
   (Connect: 0, Receive: 0, Length: 209, Exceptions: 0)
Total transferred:      361209 bytes
HTML transferred:       215209 bytes
Requests per second:    80.60 [#/sec] (mean)
Time per request:       1240.626 [ms] (mean)
Time per request:       12.406 [ms] (mean, across all concurrent requests)
Transfer rate:          28.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  10.7      0      49
Processing:    61 1176 202.5   1229    1326
Waiting:       10 1164 203.2   1219    1313
Total:         61 1180 192.8   1230    1326

Percentage of the requests served within a certain time (ms)
  50%   1230
  66%   1240
  75%   1247
  80%   1251
  90%   1264
  95%   1281
  98%   1294
  99%   1300
 100%   1326 (longest request)