test_results/ab_c100_n1000_run5.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      100
Time taken for tests:   12.514 seconds
Complete requests:      1000
Failed requests:        434
   (Connect: 0, Receive: 0, Length: 434, Exceptions: 0)
Total transferred:      361566 bytes
HTML transferred:       215566 bytes
Requests per second:    79.91 [#/sec] (mean)
Time per request:       1251.433 [ms] (mean)
Time per request:       12.514 [ms] (mean, across all concurrent requests)
Transfer rate:          28.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   9.2      0      44
Processing:    67 1183 226.1   1238    1387
Waiting:        9 1172 227.5   1225    1380
Total:         68 1187 217.5   1239    1387

Percentage of the requests served within a certain time (ms)
  50%   1239
  66%   1266
  75%   1280
  80%   1288
  90%   1309
  95%   1332
  98%   1358
  99%   1370
 100%   1387 (longest request)